In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
import seaborn as sns

In [2]:
iris = sns.load_dataset('iris')

In [3]:
# 1) a
iris.groupby('species').agg(['mean','std','min','max','count']).round(2)

           sepal_length                       sepal_width                  \
                   mean   std  min  max count        mean   std  min  max
species
setosa             5.01  0.35  4.3  5.8    50        3.43  0.38  2.3  4.4
versicolor         5.94  0.52  4.9  7.0    50        2.77  0.31  2.0  3.4
virginica          6.59  0.64  4.9  7.9    50        2.97  0.32  2.2  3.8

                 petal_length                       petal_width             \
           count         mean   std  min  max count        mean   std  min
species
setosa        50         1.46  0.17  1.0  1.9    50        0.25  0.11  0.1
versicolor    50         4.26  0.47  3.0  5.1    50        1.33  0.20  1.0
virginica     50         5.55  0.55  4.5  6.9    50        2.03  0.27  1.4


            max count
species
setosa      0.6    50
versicolor  1.8    50
virginica   2.5    50

In [4]:
Q1 = iris.quantile(0.25)
Q3 = iris.quantile(0.75)

In [5]:
lower = Q1-1.5*(Q3-Q1)
lower                       #이거보다 작은 데이터는 이상치

sepal_length    3.15
sepal_width     2.05
petal_length   -3.65
petal_width    -1.95
dtype: float64

In [6]:
upper = Q3 + 1.5*(Q3-Q1)
upper                        #이거보다 큰 데이터는 이상치

sepal_length     8.35
sepal_width      4.05
petal_length    10.35
petal_width      4.05
dtype: float64

In [7]:
k = iris[iris.species == 'setosa']['sepal_width']
k

0     3.5
1     3.0
2     3.2
3     3.1
4     3.6
5     3.9
6     3.4
7     3.4
8     2.9
9     3.1
10    3.7
11    3.4
12    3.0
13    3.0
14    4.0
15    4.4
16    3.9
17    3.5
18    3.8
19    3.8
20    3.4
21    3.7
22    3.6
23    3.3
24    3.4
25    3.0
26    3.4
27    3.5
28    3.4
29    3.2
30    3.1
31    3.4
32    4.1
33    4.2
34    3.1
35    3.2
36    3.5
37    3.6
38    3.0
39    3.4
40    3.5
41    2.3
42    3.2
43    3.5
44    3.8
45    3.0
46    3.8
47    3.2
48    3.7
49    3.3
Name: sepal_width, dtype: float64

In [8]:
s = iris[iris.species == 'setosa']['sepal_length']
s

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [9]:
Q1 = k.quantile(0.25)
Q3 = k.quantile(0.75)
iqr = Q3-Q1
Q1,Q3,iqr

(3.2, 3.6750000000000003, 0.4750000000000001)

In [10]:
lower = Q1-1.5*(Q3-Q1)
upper = Q3+1.5*(Q3-Q1)

In [11]:
Q1 = s.quantile(0.25)
Q3 = s.quantile(0.75)
lower = Q1-1.5*(Q3-Q1)
upper = Q3+1.5*(Q3-Q1)
lower, upper

(4.199999999999999, 5.800000000000001)

In [12]:
s[(s<lower)|(s>upper)] = np.nan

In [13]:
s.mean() , s.std()

(5.005999999999999, 0.3524896872134512)

In [14]:
def get_new_stat(s):
    Q1 = s.quantile(0.25)
    Q3 = s.quantile(0.75)
    lower = Q1 - 1.5*(Q3-Q1)
    upper = Q3 + 1.5*(Q3-Q1)
    s[(s<lower)|(s>upper)] = np.nan
    return s.isna().sum(),s.mean(), s.std()

In [15]:
iris.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [16]:
iris.columns[:-1]

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width'], dtype='object')

In [17]:
all = []
for species in iris.species.unique():
    for feature in iris.columns[:-1]:
        s = iris[iris.species == species][feature]
        old_mean, old_std = round(s.mean(),3), round(s.std(),4)
        outlier, new_mean, new_std = get_new_stat(s)
        d = {'species':species, 'feature':feature,'old_mean':old_mean,'old_std':old_std,
            'outlier갯수':outlier,'new mean' : round(new_mean,2), 'new_std':round(new_std,2)}
        all.append(d)
df = pd.DataFrame(all)
df.set_index(['species','feature'],inplace=True)
df

                         old_mean  old_std  outlier갯수  new mean  new_std
species    feature
setosa     sepal_length     5.006   0.3525          0      5.01     0.35
           sepal_width      3.428   0.3791          2      3.43     0.32
           petal_length     1.462   0.1737          4      1.46     0.13
           petal_width      0.246   0.1054          2      0.23     0.09
versicolor sepal_length     5.936   0.5162          0      5.94     0.52
           sepal_width      2.770   0.3138          0      2.77     0.31
           petal_length     4.260   0.4699          1      4.29     0.44
           petal_width      1.326   0.1978          0      1.33     0.20
virginica  sepal_length     6.588   0.6359          1      6.62     0.59
           sepal_width      2.974   0.3225          3      2.96     0.26
           petal_length     5.552   0.5519          0      5.55     0.55
           petal_width      2.026   0.2747          0      2.03     0.27

In [18]:
def iris_mestd(x,y):
    d = iris[iris.species==x][y]
    Q1 = d.quantile(0.25)
    Q3 = d.quantile(0.75)
    lower = Q1 - 1.5*(Q3-Q1)
    upper = Q3 + 1.5*(Q3-Q1)
    d[(d<lower)|(d>upper)] = np.nan
    return d.mean(),d.std()

In [19]:
iris_mestd('setosa','sepal_length')

(5.005999999999999, 0.3524896872134512)

In [20]:
iris_mestd('setosa','sepal_width')

(3.4312500000000004, 0.32034306743094015)

In [21]:
iris_mestd('setosa','petal_length')

(1.4608695652173913, 0.12906201931985212)

In [22]:
iris_mestd('setosa','petal_width')

(0.23333333333333328, 0.08588298157855664)

In [23]:
iris_mestd('versicolor','sepal_length')

(5.936, 0.5161711470638635)

In [24]:
iris_mestd('versicolor','sepal_width')

(2.7700000000000005, 0.3137983233784114)

In [25]:
iris_mestd('versicolor','petal_length')

(4.285714285714285, 0.4377975178854565)

In [26]:
iris_mestd('versicolor','petal_width')

(1.3259999999999998, 0.197752680004544)

In [27]:
iris_mestd('virginica','sepal_length')

(6.6224489795918355, 0.593459246748267)

In [28]:
iris_mestd('virginica','sepal_width')

(2.95531914893617, 0.26027452951125174)

In [29]:
iris_mestd('virginica','petal_length')

(5.552, 0.5518946956639835)

In [30]:
iris_mestd('virginica','petal_width')

(2.026, 0.27465005563666733)

In [31]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
import seaborn as sns

In [32]:
#2번문제
Titanic = sns.load_dataset('titanic')
Titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [33]:
# 2) a
Titanic['category1'] = Titanic.apply(lambda x: x.sex if x.age >= 20 else 'child',axis=1)
Titanic.head(20)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,male
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False,child
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True,female
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False,male
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True,child
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True,female
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False,child
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,child
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False,female
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,child

In [34]:
# 2)b 
Titanic.age.mean()

29.69911764705882

In [35]:
Titanic.age.fillna(Titanic.age.mean(),inplace=True)
Titanic.round(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.28,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.92,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.10,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.05,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

In [36]:
# 2 ) 
Titanic.groupby('sex')[['survived']].mean().round(2)

        survived
sex
female      0.74
male        0.19

In [37]:
Titanic.groupby('class')[['survived']].mean().round(2)

        survived
class
First       0.63
Second      0.47
Third       0.24

In [38]:
Titanic.groupby('embark_town')[['survived']].mean().round(2)

             survived
embark_town
Cherbourg        0.55
Queenstown       0.39
Southampton      0.34

In [39]:
Titanic.groupby(['sex','class'])[['survived']].mean().round(2)

               survived
sex    class
female First       0.97
       Second      0.92
       Third       0.50
male   First       0.37
       Second      0.16
       Third       0.14

In [40]:
# 3번문제)
mpg = sns.load_dataset('mpg')
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [41]:
# a)
mpg['hp_per_cc'] = ( mpg['horsepower']/mpg['displacement'] ).round(4)
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.4235
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.4714
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.4717
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.4934
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.4636

In [42]:
# b)
mpg['manufacturer'] = mpg.name.apply(lambda x : x.split()[0])
mpg['model'] = mpg.name.apply(lambda x: ' '.join(x.split()[1:]))
del mpg['name']
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
393,27.0,4,140.0,86.0,2790,15.6,82,usa,0.6143,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,0.5361,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,0.6222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,0.6583,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,0.6891,chevy,s-10

In [43]:
#c
mpg.groupby('cylinders')[['mpg']].mean().round(2)

             mpg
cylinders
3          20.55
4          29.29
5          27.37
6          19.99
8          14.96

In [44]:
#d
mpg.groupby('origin')[['hp_per_cc']].mean().round(2)

        hp_per_cc
origin
europe       0.74
japan        0.79
usa          0.51

In [52]:
#e
mpg.manufacturer.value_counts()

ford             51
chevrolet        43
plymouth         31
amc              28
dodge            28
toyota           25
datsun           23
buick            17
pontiac          16
volkswagen       15
honda            13
mercury          11
oldsmobile       10
mazda            10
fiat              8
peugeot           8
audi              7
volvo             6
chrysler          6
vw                6
renault           5
opel              4
saab              4
subaru            4
chevy             3
cadillac          2
mercedes-benz     2
bmw               2
maxda             2
toyouta           1
hi                1
nissan            1
vokswagen         1
triumph           1
mercedes          1
capri             1
chevroelt         1
Name: manufacturer, dtype: int64

In [77]:
s = mpg.manufacturer.value_counts()
s[s>=5]

ford          51
chevrolet     43
plymouth      31
amc           28
dodge         28
toyota        25
datsun        23
buick         17
pontiac       16
volkswagen    15
honda         13
mercury       11
oldsmobile    10
mazda         10
fiat           8
peugeot        8
audi           7
volvo          6
chrysler       6
vw             6
renault        5
Name: manufacturer, dtype: int64

In [78]:
big = s[ s>= 5].index
big

Index(['ford', 'chevrolet', 'plymouth', 'amc', 'dodge', 'toyota', 'datsun',
       'buick', 'pontiac', 'volkswagen', 'honda', 'mercury', 'oldsmobile',
       'mazda', 'fiat', 'peugeot', 'audi', 'volvo', 'chrysler', 'vw',
       'renault'],
      dtype='object')

In [79]:
'ford' in big

True

In [58]:
s.sort_values(by= '제조사 Top 5',ascending = False).head()

TypeError: sort_values() got an unexpected keyword argument 'by'

In [80]:
mpg.manufacturer.isin(big).tail()

393     True
394     True
395     True
396     True
397    False
Name: manufacturer, dtype: bool

In [81]:
big_mpg = mpg[mpg.manufacturer.isin(big)]
big_mpg.groupby('manufacturer')['mpg'].mean().sort_values(ascending=False).head(5)

manufacturer
vw         39.016667
honda      33.761538
renault    32.880000
datsun     31.113043
mazda      30.860000
Name: mpg, dtype: float64